core/app/Http/Controllers/SiteController.php

select * from `products` where `products`.`category_id` in (82, 83, 84, 85, 90, 91, 92) and `status` = 1 order by `id` desc
select count(*) as aggregate from `categories` where `status` = 1 and exists (select * from `products` where `categories`.`id` = `products`.`category_id` and `status` = 1)
---
    public function products(){



        $request = request();

        $request->validate([
            'search' => 'nullable|regex:/^[\w-]*$/'
        ]);

        $query = Category::where('status', 1)->with([
            'products' => function ($products) {
                return $products->active()->orderBy('id', 'DESC');
            },
            'products.productDetails'
        ]);

        $categories = $query->orderBy('name')->paginate(10);